{
	"data": {
		"title": "「All ARKS」 Lyrics",
		"description": "『PHANTASY STAR ONLINE 2』 Armada of Demise Battle Theme",
		"date": "2020-08-11T00:00:00.000Z"
	},
	"html": "<p>(Benovelent stars are passing the time)<br>\n(Calling on, to all of his heroes)<br>\n(Battle stars!)</p>\n<p>Never a simple hand, dealt for the times<br>\nIn the wake of dawn, our battles carving up our better days<br>\nBut we are made to believe, that this is all<br>\nWe are only what we're meant to be, let us break that ray</p>\n<p>All ARKS we ready go, in water, on land or in the sky<br>\nStand the place, are all fit back in our hands<br>\nIf a way that we must go, hope in our melody<br>\nThat it lies in our right to be free, Xiao thought he was really clear<br>\nIt's supposed to be!</p>\n<p>Whatever the odds, you stand to fight tomorrow!<br>\nBring up the will to be, so much more than what's believed to be!<br>\nNo matter the odds you stand to fight, bring us upon a better life<br>\nOnly then may we to see, only then we are to be<br>\nOnly then are we to break from the bond that exists, it's a matter of time!</p>\n<p>Never undo a plan, taking its time<br>\nIf the wait is worth, to hold onto the right move to bring better ways<br>\nNo, we are born to exceed, even if all<br>\nWe are so much more than we thought to be, so much more to be</p>\n<p>All ARKS we ready go, in water, on land or in the sky<br>\nStand the place, are all fit back in our hands<br>\nMake a way for us to go, tap into bravery<br>\nTo be rising a fight to achieve, fear nothing fear no enemies<br>\nAnswer the call to fight!</p>\n<p>Whatever it takes the will, the might to take tomorrow!<br>\nThe heart of the warrior, is what gets us up to fight again!<br>\nWhatever the cause to make to be, the wishes that our ship left to be<br>\nSo that one day we will see, so that one day we may be<br>\nAs the ones that gave ourselves for the land to be free, to inspire us all!</p>\n<p>Whatever it takes the will, the might to take tomorrow!<br>\nThe heart of the warrior, is what gets us up to fight again!<br>\nWhatever the cause to make to be, the wishes that our ship left to be<br>\nSo that one day we will see, so that one day we may be<br>\nAs the ones that gave ourselves for the land to be free, to inspire us all!</p>\n<hr>\n<p>Music: Mitsuharu Fukuyama<br>\nVocals: Aimee Blackschleger<br>\nLyrics: runblebee</p>\n<p>Recording Engineer: Naoki Sakurai<br>\nRecording Coordinator: Momoko Yamaguchi (MIT GATHERING)</p>"
}